T = 10
for _ in range(T):
    tc = int(input())
    arr = list(map(int, input().split()))
    isTerminate = False

    while True:
        for t in range(1, 6):           # 1~5까지 감소하는 게 한 사이클
            tmp = arr.pop(0) - t        # 배열의 처음 원소를 빼서 t만큼 감소시킨 값을 tmp에 저장
            if tmp <= 0:                # tmp가 0 이하라면
                arr.append(0)           # 배열 마지막에 0을 추가하고
                isTerminate = True      # 종료
                break
            arr.append(tmp)             # tmp가 양수라면 배열 마지막에 해당 값 추가
        if isTerminate:
            break

    print(f"#{tc}", *arr)

'''
1
9550 9556 9550 9553 9558 9551 9551 9551 
2
2419 2418 2423 2415 2422 2419 2420 2415 
3
7834 7840 7840 7835 7841 7835 7835 7838 
4
4088 4087 4090 4089 4093 4085 4090 4084 
5
2945 2946 2950 2948 2942 2943 2948 2947 
6
670 667 669 671 670 670 668 671 
7
8869 8869 8873 8875 8870 8872 8871 8873 
8
1709 1707 1712 1712 1714 1710 1706 1712 
9
10239 10248 10242 10240 10242 10242 10245 10235 
10
6580 6579 6574 6580 6583 6580 6577 6581 
'''